app/controllers/api/v1/batch_controller.rb

			def index
				batch = Batch.order('created_at DESC');
---
SELECT "batches".* FROM "batches" ORDER BY created_at DESC

      def create
        batch = Batch.new(batch_params)
					Order.where(reference: batch.group_of_orders).update(status: "production")
        if batch.save
---
SELECT "batches".* FROM "batches" WHERE "batches"."reference" = $1  [["reference", "1"]]
SELECT "orders".* FROM "orders" WHERE "orders"."reference" IN ($1, $2)  [["reference", "5"], ["reference", "6"]]
UPDATE "orders" SET "status" = $1, "updated_at" = $2 WHERE "orders"."reference" = $3  [["status", "production"], ["updated_at", "2020-06-20 23:32:25.328634"], ["reference", "5"]]
INSERT INTO "batches" ("reference", "purchase_channel", "group_of_orders", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "reference"  [["reference", "2"], ["purchase_channel", "site br"], ["group_of_orders", "{5,6}"], ["created_at", "2020-06-20 23:32:25.363105"], ["updated_at", "2020-06-20 23:32:25.363105"]]
UPDATE "orders" SET "status" = $1, "updated_at" = $2 WHERE "orders"."reference" = $3  [["status", "production"], ["updated_at", "2020-06-20 22:31:36.215638"], ["reference", "2"]]

			def update
				batch = Batch.find(params[:id])
					Order.where(reference: batch.group_of_orders).update(status: "closing")
---
SELECT "batches".* FROM "batches" WHERE "batches"."reference" = $1 LIMIT $2  [["reference", "2"], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."reference" IN ($1, $2)  [["reference", "5"], ["reference", "6"]]
UPDATE "orders" SET "status" = $1, "updated_at" = $2 WHERE "orders"."reference" = $3  [["status", "closing"], ["updated_at", "2020-06-21 01:23:45.163505"], ["reference", "5"]]