app/controllers/api/v1/orders_controller.rb

SELECT "orders".* FROM "orders" ORDER BY created_at DESC
---
			def index
				order = Order.order('created_at DESC');

SELECT "orders".* FROM "orders" WHERE (rogeio)
---
      def show
				order = Order.find(params[:id])

INSERT INTO "orders" ("reference", "purchase_channel", "client_name", "adress", "delivery_service", "total_value_RS", "line_items", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "reference"
---
      def create
				order = Order.new(order_params)
				if order.save